app/Controllers/Home.php

SELECT *
FROM `productos`
WHERE `tiene_oferta` = 'NO'
AND `baja` = 'NO'
ORDER BY `id_producto` DESC
---
    public function home(){
        //falta combinar las tablas de producto y oferta para poder mandar al carrusel unicamente los productos en oferta
        $data = array('titulo' => 'PetFun');
        $ofertasModel = new Ofertas_model();
        $prodOferta['productos'] = $ofertasModel->getOfertasActivas();

        $productoModel = new Productos_model();
        $listaProd['productos'] = $productoModel->orderBy('id_producto', 'DESC')->where('tiene_oferta', 'NO')->where('baja', 'NO')->findAll();