app/Controllers/mensaje_controller.php

    public function adminMensajes(){
        $mensajeModel = new Mensajes_model();
        $listaMensajes['mensajes'] = $mensajeModel->orderBy('id', 'DESC')->where('leído', 'NO')->findAll();
---
SELECT *
FROM `mensajes`
WHERE `leído` = 'NO'
ORDER BY `id` DESC