app/Controllers/usuarios_controller.php

SELECT *
FROM `usuarios`
WHERE `baja` = 'SI'
ORDER BY `id_usuario` DESC
---
    public function adminUsuariosBaja(){
        $usuarioModel = new Usuarios_model();
        $listaUsuarios['usuarios'] = $usuarioModel->orderBy('id_usuario', 'DESC')->where('baja', 'SI')->findAll();