app/Models/size_model.php

SELECT *
FROM `size`
---
    public function getSizes(){
        return $this->findAll();